particle-iot/device-os/hal/src/stm32f2xx/can_hal.c
/**
 ******************************************************************************
 * @file    can_hal.c
 * @author  Brian Spranger
 * @version V1.0.0
 * @date    30-Sep-2015
 * @brief
 ******************************************************************************
   Copyright (c) 2013-2015 Particle Industries, Inc.  All rights reserved.

   This library is free software; you can redistribute it and/or
   modify it under the terms of the GNU Lesser General Public
   License as published by the Free Software Foundation, either
   version 3 of the License, or (at your option) any later version.

   This library is distributed in the hope that it will be useful,
   but WITHOUT ANY WARRANTY; without even the implied warranty of
   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
   Lesser General Public License for more details.

   You should have received a copy of the GNU Lesser General Public
   License along with this library; if not, see <http://www.gnu.org/licenses/>.
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "can_hal.h"
#include "pinmap_impl.h"
#include "gpio_hal.h"
#include "stm32f2xx.h"

#include <string.h>

/* Private typedef -----------------------------------------------------------*/
typedef enum CAN_Num_Def
{
   CAN_D1_D2 = 0
}CAN_Num_Def;

/* Private macro -------------------------------------------------------------*/

/* Private variables ---------------------------------------------------------*/
typedef struct STM32_CAN_Info
{
   CAN_TypeDef  *can_peripheral;

   __IO uint32_t  *can_apbReg;
   uint32_t        can_clock_en;

   int32_t   can_tx_irqn;
   int32_t   can_rx0_irqn;
   int32_t   can_rx1_irqn;
   int32_t   can_sce_irqn;

   uint16_t   can_tx_pin;
   uint16_t   can_rx_pin;

   uint8_t   can_tx_pinsource;
   uint8_t   can_rx_pinsource;

   uint8_t   can_af_map;

   // Buffer pointers. These need to be global for IRQ handler access
   CAN_Ring_Buffer  *can_tx_buffer;
   CAN_Ring_Buffer  *can_rx_buffer;

   bool   can_enabled;
   bool   can_transmitting;
}STM32_CAN_Info;

STM32_CAN_Info   CAN_MAP[TOTAL_CAN] =
{
   /*
    * CAN_peripheral
    * clock control register (APBxENR)
    * clock enable bit value (RCC_APBxPeriph_CANx/RCC_APBxPeriph_CANx)
    * Tx interrupt number (CANx_TX_IRQn)
    * Rx0 interrupt number (CANx_RX0_IRQn)
    * Rx1 interrupt number (CANx_RX1_IRQn)
    * Sce interrupt number (CANx_SCE_IRQn)
    * TX pin
    * RX pin
    * TX pin source
    * RX pin source
    * GPIO AF map (GPIO_AF_CANx/GPIO_AF_CANx)
    * <tx_buffer pointer> used internally and does not appear below
    * <rx_buffer pointer> used internally and does not appear below
    * <can enabled> used internally and does not appear below
    * <can transmitting> used internally and does not appear below
    */
#if PLATFORM_ID == 6
   { CAN2, &RCC->APB1ENR, (RCC_APB1Periph_CAN1 | RCC_APB1Periph_CAN2), CAN2_TX_IRQn, CAN2_RX0_IRQn, CAN2_RX1_IRQn, CAN2_SCE_IRQn, D1, D2, GPIO_PinSource6, GPIO_PinSource5, GPIO_AF_CAN2 }  // CAN 2
#endif
};

static STM32_CAN_Info  *canMap[TOTAL_CAN]; // pointer to CAN_MAP[] containing CAN peripheral register locations (etc)

/* Extern variables ----------------------------------------------------------*/

/* Private function prototypes -----------------------------------------------*/

inline void store_message(CanRxMsg        *pmessage,
                          CAN_Ring_Buffer *buffer)
{
   unsigned   len;
   unsigned   i = (unsigned int)(buffer->head + 1) % CAN_BUFFER_SIZE;

   if (i != buffer->tail)
   {
      memset((void *)&(buffer->buffer[buffer->head]), 0, sizeof(CAN_Message_Struct));
      buffer->buffer[buffer->head].Ext = (pmessage->IDE & CAN_Id_Extended) ? true : false;

      if (buffer->buffer[buffer->head].Ext)
      {
         buffer->buffer[buffer->head].ID = pmessage->ExtId;
      }
      else
      {
         buffer->buffer[buffer->head].ID = pmessage->StdId;
      }

      buffer->buffer[buffer->head].Len = (pmessage->DLC <= 8) ? pmessage->DLC : 8;
      buffer->buffer[buffer->head].rtr = (pmessage->RTR & CAN_RTR_Remote) ? true : false;

      for (len = 0U; len < buffer->buffer[buffer->head].Len; len++)
      {
         buffer->buffer[buffer->head].Data[len] = pmessage->Data[len];
      }

      buffer->head = i;
   }
} /* store_message */


/*******************************************************************************
   Name:           HAL_CAN_Init
   Description:    Initializes the CAN data objects

   Parameters:
       @param channel CAN Channel (CAN1, CAN2, etc)
          @param rx_buffer The Rx buffer
          @param tx_buffer The Tx buffer

*******************************************************************************/
void HAL_CAN_Init(HAL_CAN_Channel  channel,
                  CAN_Ring_Buffer *rx_buffer,
                  CAN_Ring_Buffer *tx_buffer)
{
   if (channel == HAL_CAN_Channel1)
   {
      canMap[channel] = &CAN_MAP[CAN_D1_D2];
   }

   canMap[channel]->can_rx_buffer = rx_buffer;
   canMap[channel]->can_tx_buffer = tx_buffer;

   memset(canMap[channel]->can_rx_buffer, 0, sizeof(CAN_Ring_Buffer));
   memset(canMap[channel]->can_tx_buffer, 0, sizeof(CAN_Ring_Buffer));

   canMap[channel]->can_enabled      = false;
   canMap[channel]->can_transmitting = false;
}


/*******************************************************************************
   Name:           HAL_CAN_Begin
   Description:    Initializes the CAN Hardware and interrupts

   Parameters:
       @param channel CAN Channel (CAN1, CAN2, etc)
          @param baud The baud rate of the CAN bus 

*******************************************************************************/
void HAL_CAN_Begin(HAL_CAN_Channel channel,
                   uint32_t        baud)
{
   CAN_DeInit(canMap[channel]->can_peripheral);

   // Configure CAN Rx and Tx as alternate function push-pull, and enable GPIOA clock
   HAL_Pin_Mode(canMap[channel]->can_rx_pin, AF_OUTPUT_PUSHPULL);
   HAL_Pin_Mode(canMap[channel]->can_tx_pin, AF_OUTPUT_PUSHPULL);

   RCC->AHB1ENR |= RCC_AHB1Periph_GPIOB;

