particle-iot/device-os/hal/src/stm32f2xx/can_hal.c
   // Enable CAN Clock
   *(canMap[channel]->can_apbReg) |= canMap[channel]->can_clock_en;

   // Connect CAN pins to AFx
   STM32_Pin_Info  *PIN_MAP = HAL_Pin_Map();
   GPIO_PinAFConfig(PIN_MAP[canMap[channel]->can_rx_pin].gpio_peripheral, canMap[channel]->can_rx_pinsource, canMap[channel]->can_af_map);
   GPIO_PinAFConfig(PIN_MAP[canMap[channel]->can_tx_pin].gpio_peripheral, canMap[channel]->can_tx_pinsource, canMap[channel]->can_af_map);

   CAN_InitTypeDef   CAN_InitStructure;
   CAN_InitStructure.CAN_TTCM = DISABLE;
   CAN_InitStructure.CAN_ABOM = ENABLE;
   CAN_InitStructure.CAN_AWUM = DISABLE;
   CAN_InitStructure.CAN_NART = DISABLE;
   CAN_InitStructure.CAN_RFLM = DISABLE;
   CAN_InitStructure.CAN_TXFP = ENABLE;
   CAN_InitStructure.CAN_Mode = CAN_Mode_Normal;
   CAN_InitStructure.CAN_SJW  = CAN_SJW_1tq;
   CAN_InitStructure.CAN_BS1  = CAN_BS1_11tq;
   CAN_InitStructure.CAN_BS2  = CAN_BS2_3tq;

   switch (baud)
   {
      case 50000:
         CAN_InitStructure.CAN_Prescaler = 40;
         break;

      case 100000:
         CAN_InitStructure.CAN_Prescaler = 20;
         break;

      case 125000:
         CAN_InitStructure.CAN_Prescaler = 16;
         break;

      case 250000:
      default:
         CAN_InitStructure.CAN_Prescaler = 8;
         break;

      case 500000:
         CAN_InitStructure.CAN_Prescaler = 4;
         break;

      case 1000000:
         CAN_InitStructure.CAN_Prescaler = 2;
         break;
   } /* switch */

   // Configure CAN
   CAN_Init(CAN2, &CAN_InitStructure);

   CAN_FilterInitTypeDef   CAN_FilterInitStructure;

   //CAN_SlaveStartBank(1);
   CAN_FilterInitStructure.CAN_FilterNumber         = 15;
   CAN_FilterInitStructure.CAN_FilterMode           = CAN_FilterMode_IdMask;
   CAN_FilterInitStructure.CAN_FilterScale          = CAN_FilterScale_32bit;
   CAN_FilterInitStructure.CAN_FilterIdHigh         = 0x0000;
   CAN_FilterInitStructure.CAN_FilterIdLow          = 0x0000;
   CAN_FilterInitStructure.CAN_FilterMaskIdHigh     = 0x0000;
   CAN_FilterInitStructure.CAN_FilterMaskIdLow      = 0x0000;
   CAN_FilterInitStructure.CAN_FilterFIFOAssignment = CAN_FilterFIFO0;
   CAN_FilterInitStructure.CAN_FilterActivation     = ENABLE;
   CAN_FilterInit(&CAN_FilterInitStructure);

   canMap[channel]->can_enabled      = true;
   canMap[channel]->can_transmitting = false;

   // NVIC Configuration
   NVIC_InitTypeDef   NVIC_InitStructure;

   // Enable the CAN Tx Interrupt
   NVIC_InitStructure.NVIC_IRQChannel                   = canMap[channel]->can_tx_irqn;
   NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 7;
   NVIC_InitStructure.NVIC_IRQChannelSubPriority        = 0;
   NVIC_InitStructure.NVIC_IRQChannelCmd                = ENABLE;
   NVIC_Init(&NVIC_InitStructure);

   // Enable the CAN Rx FIFO 0 Interrupt
   NVIC_InitStructure.NVIC_IRQChannel                   = canMap[channel]->can_rx0_irqn;
   NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 7;
   NVIC_InitStructure.NVIC_IRQChannelSubPriority        = 0;
   NVIC_InitStructure.NVIC_IRQChannelCmd                = ENABLE;
   NVIC_Init(&NVIC_InitStructure);

   // Enable CAN Receive and Transmit interrupts
   CAN_ClearITPendingBit(canMap[channel]->can_peripheral, CAN_IT_TME);
   CAN_ITConfig(canMap[channel]->can_peripheral, CAN_IT_TME, ENABLE);
   CAN_ClearITPendingBit(canMap[channel]->can_peripheral, CAN_IT_FMP0);
   CAN_ITConfig(canMap[channel]->can_peripheral, CAN_IT_FMP0, ENABLE);
} /* HAL_CAN_Begin */


/*******************************************************************************
   Name:           HAL_CAN_End
   Description:    deinitializes the hardware

   Parameters:
       @param channel CAN Channel (CAN1, CAN2, etc)

*******************************************************************************/
void HAL_CAN_End(HAL_CAN_Channel channel)
{
   // wait for transmission of outgoing data
   while (canMap[channel]->can_tx_buffer->head != canMap[channel]->can_tx_buffer->tail)
   {
      ;
   }

   // Deinitialise CAN
   CAN_DeInit(canMap[channel]->can_peripheral);

   // Disable CAN Receive and Transmit interrupts
   CAN_ITConfig(canMap[channel]->can_peripheral, CAN_IT_TME, DISABLE);
   CAN_ITConfig(canMap[channel]->can_peripheral, CAN_IT_FMP0, DISABLE);

   NVIC_InitTypeDef   NVIC_InitStructure;

   //Disable the CAN Tx Interrupt
   NVIC_InitStructure.NVIC_IRQChannel    = canMap[channel]->can_tx_irqn;
   NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
   NVIC_Init(&NVIC_InitStructure);

   //Disable the CAN Rx FIFO 0 Interrupt
   NVIC_InitStructure.NVIC_IRQChannel    = canMap[channel]->can_rx0_irqn;
   NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
   NVIC_Init(&NVIC_InitStructure);

   // Disable CAN Clock
   *canMap[channel]->can_apbReg &= ~canMap[channel]->can_clock_en;

   // clear any received data
   canMap[channel]->can_rx_buffer->head = canMap[channel]->can_rx_buffer->tail;

   // Undo any pin re-mapping done for this CAN
   // ...

   memset(canMap[channel]->can_rx_buffer, 0, sizeof(CAN_Ring_Buffer));
   memset(canMap[channel]->can_tx_buffer, 0, sizeof(CAN_Ring_Buffer));

   canMap[channel]->can_enabled      = false;
   canMap[channel]->can_transmitting = false;
} /* HAL_CAN_End */


/*******************************************************************************
   Name:           HAL_CAN_Write_Data
   Description:    Sends a CAN message

   Parameters:
       @param channel CAN Channel (CAN1, CAN2, etc)
          @param pmessage Pointer to the CAN message
          @return 1 or -1.  1 success, -1 fail

*******************************************************************************/
uint32_t HAL_CAN_Write_Data(HAL_CAN_Channel     channel,
                            CAN_Message_Struct *pmessage)
{
   int8_t    ReturnVal;
   uint8_t   tx_mailbox = CAN_TxStatus_NoMailBox;

   if (((canMap[channel]->can_tx_buffer->head + 1) % CAN_BUFFER_SIZE) != (canMap[channel]->can_tx_buffer->tail))
   {
      memcpy((void *)&(canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->head]), (void *)pmessage, sizeof(CAN_Message_Struct));
      canMap[channel]->can_tx_buffer->head++;
      canMap[channel]->can_tx_buffer->head %= CAN_BUFFER_SIZE;
      ReturnVal = 1;
   }
   else
   {
      ReturnVal = -1;
   }

