particle-iot/device-os/hal/src/stm32f2xx/can_hal.c
   if (CAN_GetITStatus(canMap[channel]->can_peripheral, CAN_IT_TME) == RESET)
   {
      // Loop to fill up the CAN Tx buffers
      do
      {
         // Write byte to the transmit data register
         if (canMap[channel]->can_tx_buffer->head == canMap[channel]->can_tx_buffer->tail)
         {
            // drop out of the while loop
            tx_mailbox = CAN_TxStatus_NoMailBox;
         }
         else
         {
            CanTxMsg   txmessage;

            if (true == canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->tail].Ext)
            {
               txmessage.ExtId = (canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->tail].ID & 0x1FFFFFFFUL);
               txmessage.StdId = 0U;
               txmessage.IDE   = CAN_Id_Extended;
            }
            else
            {
               txmessage.ExtId = 0UL;
               txmessage.StdId = (canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->tail].ID & 0x7FFUL);
               txmessage.IDE   = CAN_Id_Standard;
            }

            if (true == canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->tail].rtr)
            {
               txmessage.RTR = CAN_RTR_REMOTE;
            }
            else
            {
               txmessage.RTR = CAN_RTR_DATA;
            }

            txmessage.DLC     = canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->tail].Len;
            txmessage.Data[0] = canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->tail].Data[0];
            txmessage.Data[1] = canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->tail].Data[1];
            txmessage.Data[2] = canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->tail].Data[2];
            txmessage.Data[3] = canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->tail].Data[3];
            txmessage.Data[4] = canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->tail].Data[4];
            txmessage.Data[5] = canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->tail].Data[5];
            txmessage.Data[6] = canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->tail].Data[6];
            txmessage.Data[7] = canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->tail].Data[7];

            tx_mailbox = CAN_Transmit(canMap[channel]->can_peripheral, &txmessage);

            if (CAN_TxStatus_NoMailBox != tx_mailbox)
            {
               canMap[channel]->can_tx_buffer->tail++;
               canMap[channel]->can_tx_buffer->tail %= CAN_BUFFER_SIZE;
            }
            else
            {
               canMap[channel]->can_transmitting = true;
            }
         }
      } while (CAN_TxStatus_NoMailBox != tx_mailbox);

      if (canMap[channel]->can_tx_buffer->head != canMap[channel]->can_tx_buffer->tail)
      {
         //Get him busy
         CAN_ITConfig(canMap[channel]->can_peripheral, CAN_IT_TME, ENABLE);
      }
   }

   return ReturnVal;
} /* HAL_CAN_Write_Data */


/*******************************************************************************
   Name:           HAL_CAN_Available_Data
   Description:    returns the number of messages pending in the buffer.

   Parameters:
       @param channel CAN Channel (CAN1, CAN2, etc)
          @return number of pending messages

*******************************************************************************/
int32_t HAL_CAN_Available_Data(HAL_CAN_Channel channel)
{
   return (unsigned int)(CAN_BUFFER_SIZE + canMap[channel]->can_rx_buffer->head - canMap[channel]->can_rx_buffer->tail) % CAN_BUFFER_SIZE;
}


/*******************************************************************************
   Name:           HAL_CAN_Read_Data
   Description:    Reads a CAN message from the buffer

   Parameters:
       @param channel CAN Channel (CAN1, CAN2, etc)
          @param pmessage pointer to where the message will be returned
          @return 1 or -1, 1 = success, -1 = fail.

*******************************************************************************/
int32_t HAL_CAN_Read_Data(HAL_CAN_Channel     channel,
                          CAN_Message_Struct *pmessage)
{
   // if the head isn't ahead of the tail, we don't have any messages
   if ((canMap[channel]->can_rx_buffer->head == canMap[channel]->can_rx_buffer->tail) || (NULL == pmessage))
   {
      return -1;
   }
   else
   {
      memcpy((void *)pmessage, (void *)&(canMap[channel]->can_rx_buffer->buffer[canMap[channel]->can_rx_buffer->tail]), sizeof(CAN_Message_Struct));
      canMap[channel]->can_rx_buffer->tail = (unsigned int)(canMap[channel]->can_rx_buffer->tail + 1) % CAN_BUFFER_SIZE;
      return 1;
   }
}


/*******************************************************************************
   Name:           HAL_CAN_Peek_Data
   Description:    returns a CAN message without removing it from the buffer

   Parameters:
       @param channel CAN Channel (CAN1, CAN2, etc)
          @param pmessage pointer to where the message will get returned
          @return 1 or -1, 1 = success, -1 = fail

*******************************************************************************/
int32_t HAL_CAN_Peek_Data(HAL_CAN_Channel     channel,
                          CAN_Message_Struct *pmessage)
{
   if ((canMap[channel]->can_rx_buffer->head == canMap[channel]->can_rx_buffer->tail) || (NULL == pmessage))
   {
      return -1;
   }
   else
   {
      memcpy((void *)pmessage, (void *)&(canMap[channel]->can_rx_buffer->buffer[canMap[channel]->can_rx_buffer->tail]), sizeof(CAN_Message_Struct));
      return 1;
   }
}


/*******************************************************************************
   Name:           HAL_CAN_Flush_Data
   Description:    Flushes the transmit buffer.  (NOT IMPLMENTED)

   Parameters:
       @param channel CAN Channel (CAN1, CAN2, etc)

*******************************************************************************/
void HAL_CAN_Flush_Data(HAL_CAN_Channel channel)
{
   //TODO // Loop until CAN DR register is empty
   //while ( canMap[channel]->can_tx_buffer->head != canMap[channel]->can_tx_buffer->tail );
   // Loop until last frame transmission complete
   //while (canMap[channel]->can_transmitting && (CAN_GetFlagStatus(canMap[channel]->can_peripheral, CAN_FLAG_TC) == RESET));
   //canMap[channel]->can_transmitting = false;
}


