particle-iot/device-os/hal/src/stm32f2xx/can_hal.c
/*******************************************************************************
   Name:           HAL_CAN_Is_Enabled
   Description:    returns if the CAN has been enabled

   Parameters:
       @param channel CAN Channel (CAN1, CAN2, etc)
          @return true or false

*******************************************************************************/
bool HAL_CAN_Is_Enabled(HAL_CAN_Channel channel)
{
   return canMap[channel]->can_enabled;
}


/*******************************************************************************
   Name:           HAL_CAN_Tx_Handler
   Description:    CAN Transmit Interrupt

   Parameters:
       @param channel CAN Channel (CAN1, CAN2, etc)

*******************************************************************************/
static void HAL_CAN_Tx_Handler(HAL_CAN_Channel channel)
{
   uint8_t   tx_mailbox = CAN_TxStatus_NoMailBox;

   if (CAN_GetITStatus(canMap[channel]->can_peripheral, CAN_IT_TME) != RESET)
   {
      // Loop to fill up the CAN Tx buffers
      do
      {
         // Write byte to the transmit data register
         if (canMap[channel]->can_tx_buffer->head == canMap[channel]->can_tx_buffer->tail)
         {
            // Buffer empty, so disable the CAN Transmit interrupt
            CAN_ITConfig(canMap[channel]->can_peripheral, CAN_IT_TME, DISABLE);

            // Turn off transmitting because buffer is empty.
            canMap[channel]->can_transmitting = false;

            // drop out of the while loop
            tx_mailbox = CAN_TxStatus_NoMailBox;
         }
         else
         {
            CanTxMsg   txmessage;

            if (true == canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->tail].Ext)
            {
               txmessage.ExtId = (canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->tail].ID & 0x1FFFFFFFUL);
               txmessage.StdId = 0U;
               txmessage.IDE   = CAN_Id_Extended;
            }
            else
            {
               txmessage.ExtId = 0UL;
               txmessage.StdId = (canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->tail].ID & 0x7FFUL);
               txmessage.IDE   = CAN_Id_Standard;
            }

            if (true == canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->tail].rtr)
            {
               txmessage.RTR = CAN_RTR_REMOTE;
            }
            else
            {
               txmessage.RTR = CAN_RTR_DATA;
            }

            txmessage.DLC     = canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->tail].Len;
            txmessage.Data[0] = canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->tail].Data[0];
            txmessage.Data[1] = canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->tail].Data[1];
            txmessage.Data[2] = canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->tail].Data[2];
            txmessage.Data[3] = canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->tail].Data[3];
            txmessage.Data[4] = canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->tail].Data[4];
            txmessage.Data[5] = canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->tail].Data[5];
            txmessage.Data[6] = canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->tail].Data[6];
            txmessage.Data[7] = canMap[channel]->can_tx_buffer->buffer[canMap[channel]->can_tx_buffer->tail].Data[7];

            tx_mailbox = CAN_Transmit(canMap[channel]->can_peripheral, &txmessage);

            if (CAN_TxStatus_NoMailBox != tx_mailbox)
            {
               canMap[channel]->can_tx_buffer->tail++;
               canMap[channel]->can_tx_buffer->tail %= CAN_BUFFER_SIZE;
            }
         }
      } while (CAN_TxStatus_NoMailBox != tx_mailbox);
   }

   CAN_ClearITPendingBit(canMap[channel]->can_peripheral, CAN_IT_TME);
} /* HAL_CAN_Tx_Handler */


/*******************************************************************************
   Name:           HAL_CAN_Rx0_Handler
   Description:    CAN FIFO0 Rx interrupt

   Parameters:
       @param channel CAN Channel (CAN1, CAN2, etc)

*******************************************************************************/
static void HAL_CAN_Rx0_Handler(HAL_CAN_Channel channel)
{
   uint8_t    i, NumPendingMessages;
   CanRxMsg   message;

   if (CAN_GetITStatus(canMap[channel]->can_peripheral, CAN_IT_FMP0) != RESET)
   {
      NumPendingMessages = CAN_MessagePending(canMap[channel]->can_peripheral, CAN_FIFO0);

      for (i = 0; i < NumPendingMessages; i++)
      {
         // Read message from the receive data register
         CAN_Receive(canMap[channel]->can_peripheral, CAN_FIFO0, &message);
         store_message(&message, canMap[channel]->can_rx_buffer);
      }
   }
}


/*******************************************************************************
   Name:           HAL_CAN_Rx1_Handler
   Description:    CAN FIFO1 Rx Interrupt

   Parameters:
       @param channel CAN Channel (CAN1, CAN2, etc)

*******************************************************************************/
static void HAL_CAN_Rx1_Handler(HAL_CAN_Channel channel)
{
   uint8_t    i, NumPendingMessages;
   CanRxMsg   message;

   NumPendingMessages = CAN_MessagePending(canMap[channel]->can_peripheral, CAN_FIFO1);

   for (i = 0; i < NumPendingMessages; i++)
   {
      // Read message from the receive data register
      CAN_Receive(canMap[channel]->can_peripheral, CAN_FIFO1, &message);
      store_message(&message, canMap[channel]->can_rx_buffer);
   }
}


/*******************************************************************************
* Function Name  : HAL_CAN2_Tx_Handler
* Description    : This function handles CAN2 Tx global interrupt request.
* Input          : None.
* Output         : None.
* Return         : None.
*******************************************************************************/
void CAN2_TX_irq(void)
{
   HAL_CAN_Tx_Handler(HAL_CAN_Channel1);
}


/*******************************************************************************
* Function Name  : HAL_CAN2_Rx0_Handler
* Description    : This function handles CAN2 Rx0 global interrupt request.
* Input          : None.
* Output         : None.
* Return         : None.
*******************************************************************************/
void CAN2_RX0_irq(void)
{
   HAL_CAN_Rx0_Handler(HAL_CAN_Channel1);
}


/*******************************************************************************
* Function Name  : HAL_CAN2_Rx1_Handler
* Description    : This function handles CAN2 Rx1 global interrupt request.
* Input          : None.
* Output         : None.
* Return         : None.
*******************************************************************************/
void CAN2_RX1_irq(void)
{
   HAL_CAN_Rx1_Handler(HAL_CAN_Channel1);
}

